Autodesk.Revit.DB.TagHeadAlignment
An enumerated type listing the tag-head alignment options supported by the Bending Detail.

Autodesk.Revit.DB.TagHeadAlignment.View
The tag-head is aligned using the view.

Autodesk.Revit.DB.TagHeadAlignment.RebarShapeFamily
The tag-head is aligned using the rebar shape family direction.